wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_dma.h
/* DMAMUX request multiplexer channel shift bit */
#define DMAMUX_RM_CHXCFG(channel)         REG32(DMAMUX_RM_CHXCFG_BASE + 0x4U * (uint32_t)(channel))              /*!< the address of DMAMUX channel CHxCFG register */

/* DMAMUX_RG_CHxCFG base address */
#define DMAMUX_RG_CHXCFG_BASE             (DMAMUX + 0x00000100U)                                                 /*!< the base address of DMAMUX channel request generator CHxCFG register */

/* DMAMUX request generator channel shift bit */
#define DMAMUX_RG_CHXCFG(channel)         REG32(DMAMUX_RG_CHXCFG_BASE + 0x4U * (uint32_t)(channel))              /*!< the address of DMAMUX channel request generator CHxCFG register */

/* DMA interrupt flag bits */
#define DMA_INT_FLAG_G                    DMA_INTF_GIF                                     /*!< global interrupt flag of channel */
#define DMA_INT_FLAG_FTF                  DMA_INTF_FTFIF                                   /*!< full transfer finish interrupt flag of channel */
#define DMA_INT_FLAG_HTF                  DMA_INTF_HTFIF                                   /*!< half transfer finish interrupt flag of channel */
#define DMA_INT_FLAG_ERR                  DMA_INTF_ERRIF                                   /*!< error interrupt flag of channel */

/* DMA flag bits */
#define DMA_FLAG_G                        DMA_INTF_GIF                                     /*!< global interrupt flag of channel */
#define DMA_FLAG_FTF                      DMA_INTF_FTFIF                                   /*!< full transfer finish flag of channel */
#define DMA_FLAG_HTF                      DMA_INTF_HTFIF                                   /*!< half transfer finish flag of channel */
#define DMA_FLAG_ERR                      DMA_INTF_ERRIF                                   /*!< error flag of channel */

/* DMA interrupt enable bits */
#define DMA_INT_FTF                       DMA_CHXCTL_FTFIE                                 /*!< enable bit for channel full transfer finish interrupt */
#define DMA_INT_HTF                       DMA_CHXCTL_HTFIE                                 /*!< enable bit for channel half transfer finish interrupt */
#define DMA_INT_ERR                       DMA_CHXCTL_ERRIE                                 /*!< enable bit for channel error interrupt */

/* DMA transfer direction */
#define DMA_PERIPHERAL_TO_MEMORY          ((uint32_t)0x00000000U)                          /*!< read from peripheral and write to memory */
#define DMA_MEMORY_TO_PERIPHERAL          ((uint32_t)0x00000001U)                          /*!< read from memory and write to peripheral */

/* DMA peripheral increasing mode */
#define DMA_PERIPH_INCREASE_DISABLE       ((uint32_t)0x00000000U)                          /*!< next address of peripheral is fixed address mode */
#define DMA_PERIPH_INCREASE_ENABLE        ((uint32_t)0x00000001U)                          /*!< next address of peripheral is increasing address mode */

/* DMA memory increasing mode */
#define DMA_MEMORY_INCREASE_DISABLE       ((uint32_t)0x00000000U)                          /*!< next address of memory is fixed address mode */
#define DMA_MEMORY_INCREASE_ENABLE        ((uint32_t)0x00000001U)                          /*!< next address of memory is increasing address mode */

/* DMA transfer data size of peripheral */
#define CHCTL_PWIDTH(regval)              (BITS(8,9) & ((uint32_t)(regval) << 8U))         /*!< transfer data size of peripheral */
#define DMA_PERIPHERAL_WIDTH_8BIT         CHCTL_PWIDTH(0U)                                 /*!< transfer data size of peripheral is 8-bit */
#define DMA_PERIPHERAL_WIDTH_16BIT        CHCTL_PWIDTH(1U)                                 /*!< transfer data size of peripheral is 16-bit */
#define DMA_PERIPHERAL_WIDTH_32BIT        CHCTL_PWIDTH(2U)                                 /*!< transfer data size of peripheral is 32-bit */

/* DMA transfer data size of memory */
#define CHCTL_MWIDTH(regval)              (BITS(10,11) & ((uint32_t)(regval) << 10U))      /*!< transfer data size of memory */
#define DMA_MEMORY_WIDTH_8BIT             CHCTL_MWIDTH(0U)                                 /*!< transfer data size of memory is 8-bit */
#define DMA_MEMORY_WIDTH_16BIT            CHCTL_MWIDTH(1U)                                 /*!< transfer data size of memory is 16-bit */
#define DMA_MEMORY_WIDTH_32BIT            CHCTL_MWIDTH(2U)                                 /*!< transfer data size of memory is 32-bit */

/* DMA channel priority level */
#define CHCTL_PRIO(regval)                (BITS(12,13) & ((uint32_t)(regval) << 12U))      /*!< DMA channel priority level */
#define DMA_PRIORITY_LOW                  CHCTL_PRIO(0U)                                   /*!< low priority */
#define DMA_PRIORITY_MEDIUM               CHCTL_PRIO(1U)                                   /*!< medium priority */
#define DMA_PRIORITY_HIGH                 CHCTL_PRIO(2U)                                   /*!< high priority */
#define DMA_PRIORITY_ULTRA_HIGH           CHCTL_PRIO(3U)                                   /*!< ultra high priority */

/* DMA transfer counter */
#define DMA_CHANNEL_CNT_MASK              DMA_CHXCNT_CNT                                   /*!< transfer counter mask */

/* DMAMUX request multiplexer channel input identification */
#define RM_CHXCFG_MUXID(regval)            (BITS(0,7) & ((uint32_t)(regval) << 0U))        /*!< multiplexer input identification */
#define DMA_REQUEST_M2M                    RM_CHXCFG_MUXID(0U)                             /*!< memory to memory transfer */
#define DMA_REQUEST_GENERATOR0             RM_CHXCFG_MUXID(1U)                             /*!< DMAMUX request generator 0 */
#define DMA_REQUEST_GENERATOR1             RM_CHXCFG_MUXID(2U)                             /*!< DMAMUX request generator 1 */
#define DMA_REQUEST_GENERATOR2             RM_CHXCFG_MUXID(3U)                             /*!< DMAMUX request generator 2 */
#define DMA_REQUEST_GENERATOR3             RM_CHXCFG_MUXID(4U)                             /*!< DMAMUX request generator 3 */
#define DMA_REQUEST_ADC0                   RM_CHXCFG_MUXID(5U)                             /*!< DMAMUX ADC0 request */
#define DMA_REQUEST_DAC0_CH0               RM_CHXCFG_MUXID(6U)                             /*!< DMAMUX DAC0 CH0 request */
#define DMA_REQUEST_DAC0_CH1               RM_CHXCFG_MUXID(7U)                             /*!< DMAMUX DAC0 CH1 request */
#define DMA_REQUEST_TIMER5_UP              RM_CHXCFG_MUXID(8U)                             /*!< DMAMUX TIMER5 UP request */
#define DMA_REQUEST_TIMER6_UP              RM_CHXCFG_MUXID(9U)                             /*!< DMAMUX TIMER6 UP request */
#define DMA_REQUEST_SPI0_RX                RM_CHXCFG_MUXID(10U)                            /*!< DMAMUX SPI0 RX request */
#define DMA_REQUEST_SPI0_TX                RM_CHXCFG_MUXID(11U)                            /*!< DMAMUX SPI0 TX request */
#define DMA_REQUEST_SPI1_RX                RM_CHXCFG_MUXID(12U)                            /*!< DMAMUX SPI1 RX request */
#define DMA_REQUEST_SPI1_TX                RM_CHXCFG_MUXID(13U)                            /*!< DMAMUX SPI1 TX request */
#define DMA_REQUEST_SPI2_RX                RM_CHXCFG_MUXID(14U)                            /*!< DMAMUX SPI2 RX request */
#define DMA_REQUEST_SPI2_TX                RM_CHXCFG_MUXID(15U)                            /*!< DMAMUX SPI2 TX request */
#define DMA_REQUEST_I2C0_RX                RM_CHXCFG_MUXID(16U)                            /*!< DMAMUX I2C0 RX request */
#define DMA_REQUEST_I2C0_TX                RM_CHXCFG_MUXID(17U)                            /*!< DMAMUX I2C0 TX request */
#define DMA_REQUEST_I2C1_RX                RM_CHXCFG_MUXID(18U)                            /*!< DMAMUX I2C1 RX request */
#define DMA_REQUEST_I2C1_TX                RM_CHXCFG_MUXID(19U)                            /*!< DMAMUX I2C1 TX request */
#define DMA_REQUEST_I2C2_RX                RM_CHXCFG_MUXID(20U)                            /*!< DMAMUX I2C2 RX request */
#define DMA_REQUEST_I2C2_TX                RM_CHXCFG_MUXID(21U)                            /*!< DMAMUX I2C2 TX request */
#define DMA_REQUEST_I2C3_RX                RM_CHXCFG_MUXID(22U)                            /*!< DMAMUX I2C3 RX request */
#define DMA_REQUEST_I2C3_TX                RM_CHXCFG_MUXID(23U)                            /*!< DMAMUX I2C3 TX request */
#define DMA_REQUEST_USART0_RX              RM_CHXCFG_MUXID(24U)                            /*!< DMAMUX USART0 RX request */
#define DMA_REQUEST_USART0_TX              RM_CHXCFG_MUXID(25U)                            /*!< DMAMUX USART0 TX request */
#define DMA_REQUEST_USART1_RX              RM_CHXCFG_MUXID(26U)                            /*!< DMAMUX USART1 RX request */
#define DMA_REQUEST_USART1_TX              RM_CHXCFG_MUXID(27U)                            /*!< DMAMUX USART1 TX request */
#define DMA_REQUEST_USART2_RX              RM_CHXCFG_MUXID(28U)                            /*!< DMAMUX USART2 RX request */
#define DMA_REQUEST_USART2_TX              RM_CHXCFG_MUXID(29U)                            /*!< DMAMUX USART2 TX request */
#define DMA_REQUEST_UART3_RX               RM_CHXCFG_MUXID(30U)                            /*!< DMAMUX UART3 RX request */
#define DMA_REQUEST_UART3_TX               RM_CHXCFG_MUXID(31U)                            /*!< DMAMUX UART3 TX request */
#define DMA_REQUEST_UART4_RX               RM_CHXCFG_MUXID(32U)                            /*!< DMAMUX UART4 RX request */
#define DMA_REQUEST_UART4_TX               RM_CHXCFG_MUXID(33U)                            /*!< DMAMUX UART4 TX request */
#define DMA_REQUEST_ADC1                   RM_CHXCFG_MUXID(34U)                            /*!< DMAMUX ADC1 request */
#define DMA_REQUEST_ADC2                   RM_CHXCFG_MUXID(35U)                            /*!< DMAMUX ADC2 request */
#define DMA_REQUEST_ADC3                   RM_CHXCFG_MUXID(36U)                            /*!< DMAMUX ADC3 request */
#define DMA_REQUEST_QSPI                   RM_CHXCFG_MUXID(37U)                            /*!< DMAMUX QSPI request */
#define DMA_REQUEST_DAC1_CH0               RM_CHXCFG_MUXID(38U)                            /*!< DMAMUX DAC1 CH0 request */
#define DMA_REQUEST_DAC1_CH1               RM_CHXCFG_MUXID(39U)                            /*!< DMAMUX DAC1 CH1 request */
#define DMA_REQUEST_TIMER0_CH0             RM_CHXCFG_MUXID(40U)                            /*!< DMAMUX TIMER0 CH0 request */
#define DMA_REQUEST_TIMER0_CH1             RM_CHXCFG_MUXID(41U)                            /*!< DMAMUX TIMER0 CH1 request */
#define DMA_REQUEST_TIMER0_CH2             RM_CHXCFG_MUXID(42U)                            /*!< DMAMUX TIMER0 CH2 request */
#define DMA_REQUEST_TIMER0_CH3             RM_CHXCFG_MUXID(43U)                            /*!< DMAMUX TIMER0 CH3 request */
#define DMA_REQUEST_TIMER0_CH0N            RM_CHXCFG_MUXID(44U)                            /*!< DMAMUX TIMER0 CH0N request */
#define DMA_REQUEST_TIMER0_CH1N            RM_CHXCFG_MUXID(45U)                            /*!< DMAMUX TIMER0 CH1N request */
#define DMA_REQUEST_TIMER0_CH2N            RM_CHXCFG_MUXID(46U)                            /*!< DMAMUX TIMER0 CH2N request */
#define DMA_REQUEST_TIMER0_CH3N            RM_CHXCFG_MUXID(47U)                            /*!< DMAMUX TIMER0 CH3N request */
#define DMA_REQUEST_TIMER0_UP              RM_CHXCFG_MUXID(48U)                            /*!< DMAMUX TIMER0 UP request */
#define DMA_REQUEST_TIMER0_TRG             RM_CHXCFG_MUXID(49U)                            /*!< DMAMUX TIMER0 TRG request */
#define DMA_REQUEST_TIMER0_CMT             RM_CHXCFG_MUXID(50U)                            /*!< DMAMUX TIMER0 CMT request */
#define DMA_REQUEST_TIMER7_CH0             RM_CHXCFG_MUXID(51U)                            /*!< DMAMUX TIMER7 CH0 request */
#define DMA_REQUEST_TIMER7_CH1             RM_CHXCFG_MUXID(52U)                            /*!< DMAMUX TIMER7 CH1 request */
#define DMA_REQUEST_TIMER7_CH2             RM_CHXCFG_MUXID(53U)                            /*!< DMAMUX TIMER7 CH2 request */
#define DMA_REQUEST_TIMER7_CH3             RM_CHXCFG_MUXID(54U)                            /*!< DMAMUX TIMER7 CH3 request */
#define DMA_REQUEST_TIMER7_CH0N            RM_CHXCFG_MUXID(55U)                            /*!< DMAMUX TIMER7 CH0N request */
#define DMA_REQUEST_TIMER7_CH1N            RM_CHXCFG_MUXID(56U)                            /*!< DMAMUX TIMER7 CH1N request */
#define DMA_REQUEST_TIMER7_CH2N            RM_CHXCFG_MUXID(57U)                            /*!< DMAMUX TIMER7 CH2N request */
#define DMA_REQUEST_TIMER7_CH3N            RM_CHXCFG_MUXID(58U)                            /*!< DMAMUX TIMER7 CH3N request */
#define DMA_REQUEST_TIMER7_UP              RM_CHXCFG_MUXID(59U)                            /*!< DMAMUX TIMER7 UP request */
#define DMA_REQUEST_TIMER7_TRG             RM_CHXCFG_MUXID(60U)                            /*!< DMAMUX TIMER7 TRG request */
#define DMA_REQUEST_TIMER7_CMT             RM_CHXCFG_MUXID(61U)                            /*!< DMAMUX TIMER7 CMT request */
#define DMA_REQUEST_TIMER1_CH0             RM_CHXCFG_MUXID(62U)                            /*!< DMAMUX TIMER1 CH0 request */
#define DMA_REQUEST_TIMER1_CH1             RM_CHXCFG_MUXID(63U)                            /*!< DMAMUX TIMER1 CH1 request */
#define DMA_REQUEST_TIMER1_CH2             RM_CHXCFG_MUXID(64U)                            /*!< DMAMUX TIMER1 CH2 request */
#define DMA_REQUEST_TIMER1_CH3             RM_CHXCFG_MUXID(65U)                            /*!< DMAMUX TIMER1 CH3 request */
#define DMA_REQUEST_TIMER1_UP              RM_CHXCFG_MUXID(66U)                            /*!< DMAMUX TIMER1 UP request */
#define DMA_REQUEST_TIMER1_TRG             RM_CHXCFG_MUXID(67U)                            /*!< DMAMUX TIMER1 TRG request */
#define DMA_REQUEST_TIMER2_CH0             RM_CHXCFG_MUXID(68U)                            /*!< DMAMUX TIMER2 CH0 request */
#define DMA_REQUEST_TIMER2_CH1             RM_CHXCFG_MUXID(69U)                            /*!< DMAMUX TIMER2 CH1 request */
#define DMA_REQUEST_TIMER2_CH2             RM_CHXCFG_MUXID(70U)                            /*!< DMAMUX TIMER2 CH2 request */
#define DMA_REQUEST_TIMER2_CH3             RM_CHXCFG_MUXID(71U)                            /*!< DMAMUX TIMER2 CH3 request */
#define DMA_REQUEST_TIMER2_UP              RM_CHXCFG_MUXID(72U)                            /*!< DMAMUX TIMER2 UP request */
#define DMA_REQUEST_TIMER2_TRG             RM_CHXCFG_MUXID(73U)                            /*!< DMAMUX TIMER2 TRG request */
#define DMA_REQUEST_TIMER3_CH0             RM_CHXCFG_MUXID(74U)                            /*!< DMAMUX TIMER3 CH0 request */
#define DMA_REQUEST_TIMER3_CH1             RM_CHXCFG_MUXID(75U)                            /*!< DMAMUX TIMER3 CH1 request */
#define DMA_REQUEST_TIMER3_CH2             RM_CHXCFG_MUXID(76U)                            /*!< DMAMUX TIMER3 CH2 request */
#define DMA_REQUEST_TIMER3_CH3             RM_CHXCFG_MUXID(77U)                            /*!< DMAMUX TIMER3 CH3 request */
#define DMA_REQUEST_TIMER3_UP              RM_CHXCFG_MUXID(78U)                            /*!< DMAMUX TIMER3 UP request */
#define DMA_REQUEST_TIMER3_TRG             RM_CHXCFG_MUXID(79U)                            /*!< DMAMUX TIMER3 TRG request */
#define DMA_REQUEST_TIMER4_CH0             RM_CHXCFG_MUXID(80U)                            /*!< DMAMUX TIMER4 CH0 request */
#define DMA_REQUEST_TIMER4_CH1             RM_CHXCFG_MUXID(81U)                            /*!< DMAMUX TIMER4 CH1 request */
#define DMA_REQUEST_TIMER4_CH2             RM_CHXCFG_MUXID(82U)                            /*!< DMAMUX TIMER4 CH2 request */
#define DMA_REQUEST_TIMER4_CH3             RM_CHXCFG_MUXID(83U)                            /*!< DMAMUX TIMER4 CH3 request */
#define DMA_REQUEST_TIMER4_UP              RM_CHXCFG_MUXID(84U)                            /*!< DMAMUX TIMER4 UP request */
#define DMA_REQUEST_TIMER4_TRG             RM_CHXCFG_MUXID(85U)                            /*!< DMAMUX TIMER4 TRG request */
#define DMA_REQUEST_TIMER14_CH0            RM_CHXCFG_MUXID(86U)                            /*!< DMAMUX TIMER14 CH0 request */
#define DMA_REQUEST_TIMER14_CH1            RM_CHXCFG_MUXID(87U)                            /*!< DMAMUX TIMER14 CH1 request */
#define DMA_REQUEST_TIMER14_CH0N           RM_CHXCFG_MUXID(88U)                            /*!< DMAMUX TIMER14 CH0N request */
#define DMA_REQUEST_TIMER14_UP             RM_CHXCFG_MUXID(89U)                            /*!< DMAMUX TIMER14 UP request */
#define DMA_REQUEST_TIMER14_TRG            RM_CHXCFG_MUXID(90U)                            /*!< DMAMUX TIMER14 TRG request */
#define DMA_REQUEST_TIMER14_COM            RM_CHXCFG_MUXID(91U)                            /*!< DMAMUX TIMER14 COM request */
#define DMA_REQUEST_TIMER15_CH0            RM_CHXCFG_MUXID(92U)                            /*!< DMAMUX TIMER15 CH0 request */
#define DMA_REQUEST_TIMER15_CH0N           RM_CHXCFG_MUXID(93U)                            /*!< DMAMUX TIMER15 CH0N request */
#define DMA_REQUEST_TIMER15_UP             RM_CHXCFG_MUXID(94U)                            /*!< DMAMUX TIMER15 UP request */
#define DMA_REQUEST_TIMER16_CH0            RM_CHXCFG_MUXID(95U)                            /*!< DMAMUX TIMER16 CH0 request */
#define DMA_REQUEST_TIMER16_CH0N           RM_CHXCFG_MUXID(96U)                            /*!< DMAMUX TIMER16 CH0N request */
#define DMA_REQUEST_TIMER16_UP             RM_CHXCFG_MUXID(97U)                            /*!< DMAMUX TIMER16 UP request */
#define DMA_REQUEST_TIMER19_CH0            RM_CHXCFG_MUXID(98U)                            /*!< DMAMUX TIMER19 CH0 request */
#define DMA_REQUEST_TIMER19_CH1            RM_CHXCFG_MUXID(99U)                            /*!< DMAMUX TIMER19 CH1 request */
#define DMA_REQUEST_TIMER19_CH2            RM_CHXCFG_MUXID(100U)                           /*!< DMAMUX TIMER19 CH2 request */
#define DMA_REQUEST_TIMER19_CH3            RM_CHXCFG_MUXID(101U)                           /*!< DMAMUX TIMER19 CH3 request */
#define DMA_REQUEST_TIMER19_CH0N           RM_CHXCFG_MUXID(102U)                           /*!< DMAMUX TIMER19 CH0N request */
#define DMA_REQUEST_TIMER19_CH1N           RM_CHXCFG_MUXID(103U)                           /*!< DMAMUX TIMER19 CH1N request */
#define DMA_REQUEST_TIMER19_CH2N           RM_CHXCFG_MUXID(104U)                           /*!< DMAMUX TIMER19 CH2N request */
#define DMA_REQUEST_TIMER19_CH3N           RM_CHXCFG_MUXID(105U)                           /*!< DMAMUX TIMER19 CH3N request */
#define DMA_REQUEST_TIMER19_UP             RM_CHXCFG_MUXID(106U)                           /*!< DMAMUX TIMER19 UP request */
#define DMA_REQUEST_TIMER19_TRG            RM_CHXCFG_MUXID(107U)                           /*!< DMAMUX TIMER19 TRG request */
#define DMA_REQUEST_TIMER19_CMT            RM_CHXCFG_MUXID(108U)                           /*!< DMAMUX TIMER19 CMT request */
#define DMA_REQUEST_CAU_IN                 RM_CHXCFG_MUXID(109U)                           /*!< DMAMUX CAU_IN request */
#define DMA_REQUEST_CAU_OUT                RM_CHXCFG_MUXID(110U)                           /*!< DMAMUX CAU_OUT request */
#define DMA_REQUEST_HRTIMER_MASTER         RM_CHXCFG_MUXID(111U)                           /*!< DMAMUX HRTIMER MASTER request */
#define DMA_REQUEST_HRTIMER_TIMER0         RM_CHXCFG_MUXID(112U)                           /*!< DMAMUX HRTIMER TIMERA request */
#define DMA_REQUEST_HRTIMER_TIMER1         RM_CHXCFG_MUXID(113U)                           /*!< DMAMUX HRTIMER TIMERB request */
#define DMA_REQUEST_HRTIMER_TIMER2         RM_CHXCFG_MUXID(114U)                           /*!< DMAMUX HRTIMER TIMERC request */
#define DMA_REQUEST_HRTIMER_TIMER3         RM_CHXCFG_MUXID(115U)                           /*!< DMAMUX HRTIMER TIMERD request */
#define DMA_REQUEST_HRTIMER_TIMER4         RM_CHXCFG_MUXID(116U)                           /*!< DMAMUX HRTIMER TIMERA request */
#define DMA_REQUEST_HRTIMER_TIMER5         RM_CHXCFG_MUXID(117U)                           /*!< DMAMUX HRTIMER TIMERB request */
#define DMA_REQUEST_HRTIMER_TIMER6         RM_CHXCFG_MUXID(118U)                           /*!< DMAMUX HRTIMER TIMERC request */
#define DMA_REQUEST_HRTIMER_TIMER7         RM_CHXCFG_MUXID(119U)                           /*!< DMAMUX HRTIMER TIMERD request */
#define DMA_REQUEST_DAC2_CH0               RM_CHXCFG_MUXID(120U)                           /*!< DMAMUX DAC2 CH0 request */
#define DMA_REQUEST_DAC2_CH1               RM_CHXCFG_MUXID(121U)                           /*!< DMAMUX DAC2 CH1 request */
#define DMA_REQUEST_DAC3_CH0               RM_CHXCFG_MUXID(122U)                           /*!< DMAMUX DAC3 CH0 request */
#define DMA_REQUEST_DAC3_CH1               RM_CHXCFG_MUXID(123U)                           /*!< DMAMUX DAC3 CH1 request */
#define DMA_REQUEST_HPDF_FLT0              RM_CHXCFG_MUXID(124U)                           /*!< DMAMUX HPDF FLT0 request */
#define DMA_REQUEST_HPDF_FLT1              RM_CHXCFG_MUXID(125U)                           /*!< DMAMUX HPDF FLT1 request */
#define DMA_REQUEST_HPDF_FLT2              RM_CHXCFG_MUXID(126U)                           /*!< DMAMUX HPDF FLT2 request */
#define DMA_REQUEST_HPDF_FLT3              RM_CHXCFG_MUXID(127U)                           /*!< DMAMUX HPDF FLT3 request */
#define DMA_REQUEST_FAC_READ               RM_CHXCFG_MUXID(128U)                           /*!< DMAMUX FAC READ request */
#define DMA_REQUEST_FAC_WRITE              RM_CHXCFG_MUXID(129U)                           /*!< DMAMUX FAC WRITE request */
#define DMA_REQUEST_TMU_INPUT              RM_CHXCFG_MUXID(130U)                           /*!< DMAMUX TMU INPUT request */
#define DMA_REQUEST_TMU_OUTPUT             RM_CHXCFG_MUXID(131U)                           /*!< DMAMUX TMU OUTPUT request */
#define DMA_REQUEST_CAN0                   RM_CHXCFG_MUXID(132U)                           /*!< DMAMUX CAN0 request */
#define DMA_REQUEST_CAN1                   RM_CHXCFG_MUXID(133U)                           /*!< DMAMUX CAN1 request */
#define DMA_REQUEST_CAN2                   RM_CHXCFG_MUXID(134U)                           /*!< DMAMUX CAN2 request */

