wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_dma.h
/* DMAMUX request generator trigger input identification */
#define RG_CHXCFG_TID(regval)              (BITS(0,4) & ((uint32_t)(regval) << 0U))        /*!< trigger input identification */
#define DMAMUX_TRIGGER_EXTI0               RG_CHXCFG_TID(0U)                               /*!< trigger input is EXTI0 */
#define DMAMUX_TRIGGER_EXTI1               RG_CHXCFG_TID(1U)                               /*!< trigger input is EXTI1 */
#define DMAMUX_TRIGGER_EXTI2               RG_CHXCFG_TID(2U)                               /*!< trigger input is EXTI2 */
#define DMAMUX_TRIGGER_EXTI3               RG_CHXCFG_TID(3U)                               /*!< trigger input is EXTI3 */
#define DMAMUX_TRIGGER_EXTI4               RG_CHXCFG_TID(4U)                               /*!< trigger input is EXTI4 */
#define DMAMUX_TRIGGER_EXTI5               RG_CHXCFG_TID(5U)                               /*!< trigger input is EXTI5 */
#define DMAMUX_TRIGGER_EXTI6               RG_CHXCFG_TID(6U)                               /*!< trigger input is EXTI6 */
#define DMAMUX_TRIGGER_EXTI7               RG_CHXCFG_TID(7U)                               /*!< trigger input is EXTI7 */
#define DMAMUX_TRIGGER_EXTI8               RG_CHXCFG_TID(8U)                               /*!< trigger input is EXTI8 */
#define DMAMUX_TRIGGER_EXTI9               RG_CHXCFG_TID(9U)                               /*!< trigger input is EXTI9 */
#define DMAMUX_TRIGGER_EXTI10              RG_CHXCFG_TID(10U)                              /*!< trigger input is EXTI10 */
#define DMAMUX_TRIGGER_EXTI11              RG_CHXCFG_TID(11U)                              /*!< trigger input is EXTI11 */
#define DMAMUX_TRIGGER_EXTI12              RG_CHXCFG_TID(12U)                              /*!< trigger input is EXTI12 */
#define DMAMUX_TRIGGER_EXTI13              RG_CHXCFG_TID(13U)                              /*!< trigger input is EXTI13 */
#define DMAMUX_TRIGGER_EXTI14              RG_CHXCFG_TID(14U)                              /*!< trigger input is EXTI14 */
#define DMAMUX_TRIGGER_EXTI15              RG_CHXCFG_TID(15U)                              /*!< trigger input is EXTI15 */
#define DMAMUX_TRIGGER_EVTX_OUT0           RG_CHXCFG_TID(16U)                              /*!< trigger input is Evtx_out0 */
#define DMAMUX_TRIGGER_EVTX_OUT1           RG_CHXCFG_TID(17U)                              /*!< trigger input is Evtx_out1 */
#define DMAMUX_TRIGGER_EVTX_OUT2           RG_CHXCFG_TID(18U)                              /*!< trigger input is Evtx_out2 */
#define DMAMUX_TRIGGER_EVTX_OUT3           RG_CHXCFG_TID(19U)                              /*!< trigger input is Evtx_out3 */
#define DMAMUX_TRIGGER_LPTIMER_OUT         RG_CHXCFG_TID(20U)                              /*!< trigger input is LPTIMER OUT */

/* DMAMUX request generator trigger polarity */
#define RM_CHXCFG_RGTP(regval)              (BITS(17,18) & ((uint32_t)(regval) << 17U))    /*!< DMA request generator trigger polarity */
#define DMAMUX_GEN_NO_EVENT                 RM_CHXCFG_RGTP(0U)                             /*!< no event detection */
#define DMAMUX_GEN_RISING                   RM_CHXCFG_RGTP(1U)                             /*!< rising edge */
#define DMAMUX_GEN_FALLING                  RM_CHXCFG_RGTP(2U)                             /*!< falling edge */
#define DMAMUX_GEN_RISING_FALLING           RM_CHXCFG_RGTP(3U)                             /*!< rising and falling edges */

/* number of DMA requests to be generated */
#define RG_CHXCFG_NBRG(regval)              (BITS(19,23) & ((uint32_t)(regval) << 19U))    /*!< number of DMA requests to be generated */

/* DMAMUX request multiplexer channel synchronization input identification */
#define RM_CHXCFG_SYNCID(regval)            (BITS(24,28) & ((uint32_t)(regval) << 24U))    /*!< synchronization input identification */
#define DMAMUX_SYNC_EXTI0                   RM_CHXCFG_SYNCID(0U)                           /*!< synchronization input is EXTI0 */
#define DMAMUX_SYNC_EXTI1                   RM_CHXCFG_SYNCID(1U)                           /*!< synchronization input is EXTI1 */
#define DMAMUX_SYNC_EXTI2                   RM_CHXCFG_SYNCID(2U)                           /*!< synchronization input is EXTI2 */
#define DMAMUX_SYNC_EXTI3                   RM_CHXCFG_SYNCID(3U)                           /*!< synchronization input is EXTI3 */
#define DMAMUX_SYNC_EXTI4                   RM_CHXCFG_SYNCID(4U)                           /*!< synchronization input is EXTI4 */
#define DMAMUX_SYNC_EXTI5                   RM_CHXCFG_SYNCID(5U)                           /*!< synchronization input is EXTI5 */
#define DMAMUX_SYNC_EXTI6                   RM_CHXCFG_SYNCID(6U)                           /*!< synchronization input is EXTI6 */
#define DMAMUX_SYNC_EXTI7                   RM_CHXCFG_SYNCID(7U)                           /*!< synchronization input is EXTI7 */
#define DMAMUX_SYNC_EXTI8                   RM_CHXCFG_SYNCID(8U)                           /*!< synchronization input is EXTI8 */
#define DMAMUX_SYNC_EXTI9                   RM_CHXCFG_SYNCID(9U)                           /*!< synchronization input is EXTI9 */
#define DMAMUX_SYNC_EXTI10                  RM_CHXCFG_SYNCID(10U)                          /*!< synchronization input is EXTI10 */
#define DMAMUX_SYNC_EXTI11                  RM_CHXCFG_SYNCID(11U)                          /*!< synchronization input is EXTI11 */
#define DMAMUX_SYNC_EXTI12                  RM_CHXCFG_SYNCID(12U)                          /*!< synchronization input is EXTI12 */
#define DMAMUX_SYNC_EXTI13                  RM_CHXCFG_SYNCID(13U)                          /*!< synchronization input is EXTI13 */
#define DMAMUX_SYNC_EXTI14                  RM_CHXCFG_SYNCID(14U)                          /*!< synchronization input is EXTI14 */
#define DMAMUX_SYNC_EXTI15                  RM_CHXCFG_SYNCID(15U)                          /*!< synchronization input is EXTI15 */
#define DMAMUX_SYNC_EVTX_OUT0               RM_CHXCFG_SYNCID(16U)                          /*!< synchronization input is Evtx_out0 */
#define DMAMUX_SYNC_EVTX_OUT1               RM_CHXCFG_SYNCID(17U)                          /*!< synchronization input is Evtx_out1 */
#define DMAMUX_SYNC_EVTX_OUT2               RM_CHXCFG_SYNCID(18U)                          /*!< synchronization input is Evtx_out2 */
#define DMAMUX_SYNC_EVTX_OUT3               RM_CHXCFG_SYNCID(19U)                          /*!< synchronization input is Evtx_out3 */
#define DMAMUX_SYNC_LPTIMER_OUT             RM_CHXCFG_SYNCID(20U)                          /*!< synchronization input is LPTIMER OUT */

